modules_cxf_src_test_java_org_mule_runtime_module_cxf_ProxyTestCase.java/[CN]/ProxyTestCase/[MT]/testProxyOneWayFault()/body

{
  String payload="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<soap:Body>" + "<emp:addEmployee xmlns:emp=\"http://employee.example.mule.org/\">"+ "<emp:employee>"+ "<emp:division>Runtime</emp:division>"+ "<emp:name>Pepe</emp:name>"+ "</emp:employee>"+ "</emp:addEmployee>"+ "</soap:Body>"+ "</soap:Envelope>";
  MuleClient client=muleContext.getClient();
  InternalMessage result=client.send("http://localhost:" + dynamicPort.getNumber() + "/proxyOneWayFault",InternalMessage.builder().payload(payload).build(),HTTP_REQUEST_OPTIONS).getRight();
  assertThat(result,is(notNullValue()));
  assertThat(getPayloadAsString(result),containsString("ERROR"));
}
